app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."user_id" IS NULL LIMIT ?  [["LIMIT", 1]]
---
   def load_user
    User.find_for_database_authentication(email: sign_in_params[:email])