app/controllers/uploads_controller.rb

  def set_upload
    @upload = Upload.find(params[:id])
---
SELECT "uploads".* FROM "uploads" WHERE "uploads"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]