app/controllers/uploads_controller.rb

SELECT "uploads".* FROM "uploads" ORDER BY "uploads"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
  def index
    @uploads = Upload.all

SELECT "uploads".* FROM "uploads" WHERE "uploads"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    if upload_exists?(params[:id])
      @upload = Upload.find(params[:id])

INSERT INTO "uploads" ("name", "binary", "created_at", "updated_at", "image", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["name", "test"], ["binary", "Rt0=\n"], ["created_at", "2019-11-10 23:47:57.877839"], ["updated_at", "2019-11-10 23:47:57.877839"], ["image", "image.png"], ["user_id", 1]]
---
  def create
    file_name = params[:upload][:file]
    incoming_file = params[:upload][:binary]
    uri = "#{Rails.root}/uploads/#{file_name}"
    FileUtils.cp_r incoming_file, uri

    @upload = Upload.new(user_id: current_user.id, filename: file_name, uri: uri)

    if @upload.save

SELECT "uploads".* FROM "uploads" WHERE "uploads"."id" = ? LIMIT ?  [["id", 30], ["LIMIT", 1]]
DELETE FROM "uploads" WHERE "uploads"."id" = ?  [["id", 1]]
---
  def destroy
    if upload_exists?(params[:id])
      @upload = Upload.find(params[:id])
      @upload.destroy

SELECT "uploads".* FROM "uploads" WHERE "uploads"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def set_upload
    @upload = Upload.find(params[:id])